In [1]:
# reading dataset to python
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
df=pd.read_csv("C:\\Users\\DELL\\Desktop\\ICT REF\\case study\\2\\StudentsPerformance.csv")
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [2]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

# 1. Find out how many males and females participated in the test.

In [3]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# 2. What do you think about the students' parental level of education?

In [4]:
df['parental level of education'].mode()

0    some college
dtype: object

In [ ]:
From the above data, we can infer that most of the parents' have college level of education.

# 3. Who scores the most on average for math, reading and writing based on

# ● Gender

In [99]:
score1=df.groupby('gender')['math score'].mean().nlargest(1)
score2=df.groupby('gender')['reading score'].mean().nlargest(1)
score3=df.groupby('gender')['writing score'].mean().nlargest(1)
score1
score2
score3

gender
female    72.467181
Name: writing score, dtype: float64

# ● Test preparation course

In [100]:
score1=df.groupby('test preparation course')['math score'].mean().nlargest(1)
score2=df.groupby('test preparation course')['reading score'].mean().nlargest(1)
score3=df.groupby('test preparation course')['writing score'].mean().nlargest(1)
score1
score2
score3

test preparation course
completed    74.684358
Name: writing score, dtype: float64

# 4. What do you think about the scoring variation for math, reading and writing based on

# ● Gender

In [98]:
var1=df.groupby('gender')['math score','reading score','writing score'].var()
var1

<ipython-input-98-e86947ac916f>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  var1=df.groupby('gender')['math score','reading score','writing score'].var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [ ]:
for both male and female,score variation is high in math score and least in  reading score.

# ● Test preparation course

In [65]:
var2=df.groupby('test preparation course')['math score','reading score','writing score'].var()
var2

<ipython-input-65-f6de9bd8334d>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  var2=df.groupby('test preparation course')['math score','reading score','writing score'].var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [ ]:
For those who have completed test preparation course,variation is high in maths score and least in writing score.
for those who have not taken the test preparation course, variation is high in math score and low in reading score.

# 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [95]:
q75 = df['math score'].quantile(q=0.75)
df[df['math score'].ge(q75)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
414,female,group A,high school,free/reduced,completed,77,88,85
415,female,group B,master's degree,free/reduced,completed,77,97,94
416,female,group B,bachelor's degree,free/reduced,none,77,85,87
417,female,group B,master's degree,standard,none,77,90,84
418,female,group B,high school,standard,completed,77,82,89
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [ ]:
The management can give bonus points to students having their maths score greter than or equal to 77.